{"inkVersion":20,"root":[["^&FADE_OUT:0","\n","^&ACTOR:Arin","\n","^&THINK:Arin","\n","^This has been one weird and tiring day so far.","\n","^Everything was pretty ordinary, then Jory got framed and we had to defend him in court!","\n","^Or, what everyone was calling a court, at least. And there was someone who looked like trivia boy?","\n","^I guess it was all his idea?","\n","^Well, what I really need to think about is just what was that tutorial guy's deal?","\n","^&SCENE:TMPH_Assistant","\n","^&ACTOR:Dan","\n","^&FADE_IN: 1.5","\n","^&SPEAK:Dan","\n","^...and so we're going to talk to him about all that, right?","\n","^&SPEAK:Arin","\n","^Hu-uhh... wait what're you talking about again?","\n","^&SET_POSE:Angry","\n","^&SPEAK:Dan","\n","^C'mon Arin, snap out of it! What's with you spacing out today?","\n","^&SPEAK:Arin","\n","^Whaddya mean? That whole dang trial was exhausting. I mean I slammed my hands down multiple times.","\n","^I put a lot of energy into helping Jory, and it turns out it was all for a video! Can you fuckin' believe that shit?","\n","^&SET_POSE:Normal","\n","^&SPEAK:Dan","\n","^Yeah that was certainly a twist, but you gotta admit it was pretty fun!","\n","^&SPEAK:Arin","\n","^Can't deny that man. It's not every day i get to shout loudly and slam my hands onto things!","\n","^&SPEAK:Dan","\n","^Arin, you do that for a living.","\n","^&SET_POSE:Laughing","\n","^&SPEAK:Arin","\n","^Not the slamming though! I gotta have my slamdown!","\n","^&SET_POSE:Happy","\n","^&SPEAK:Dan","\n","^SLAM! Duh dunuh, duh dunuh, LET THE BOYS BE BOYS.","\n","^&set_pose:Normal","\n","^&SPEAK:Arin","\n","^Classic","\n","^Anyways, where is this Tutorial_Boy slash guy?","\n","^&SPEAK:Dan","\n","^I dunno.","\n","^&SET_POSE:Surprise","\n","^Wait, you don't know where we're meeting him?!","\n","^&SPEAK:Arin","\n","^How would I know? He didn't say shit to me!","\n","^Fuck, I guess we gotta look for him. He's not just gonna pop up.","\n","^&ACTOR:Tutorial_Boy","\n","^&PLAY_SFX:slidewhistle","\n","^&SPEAK:Tutorial_Boy","\n","^QUITE THE CONTRARY!","\n","^&SPEAK:Dan","\n","^OH GOD! The hell man you scared the shit out of me, the hell are you doing on the floor?","\n","^&SPEAK:Tutorial_Boy","\n","^I got bored of waiting for you so I decided to lay down","\n","^&SPEAK:Arin","\n","^Well then, were you comfortable with our wood, Mr. Tutorial?","\n","^&SPEAK:Tutorial_Boy","\n","^Well I was until you said it like that...","\n","^&SPEAK:Dan","\n","^What are you two talking about?! We don't even have wooden floors.","\n","^&SPEAK:Arin","\n","^Whatever Dan! Can we just start asking questions now that he's here? We need some answers!","\n","^&SPEAK:Tutorial_Boy","\n","^As do I, so I'll answer whatever it is so long as you listen to me as well.","\n","^&SPEAK:Arin","\n","^Ok, great. Now, can you explain what the heck you're doing?","\n","^What're you really here for?","\n","^&SPEAK:Tutorial_Boy","\n","^Truthfully I can't get into all the details. Something serious is going on and I need your help.","\n","^&SPEAK:Tutorial_Boy","\n","^But it involves people in Attitude City, and you might be the only ones I can count on, if you can believe it.","\n","^&SPEAK:Arin","\n","^Whoa, Attitude City? What?","\n","^&SPEAK:Dan","\n","^C'mon dude we made that up for our albums. Get serious!","\n","^&SPEAK:Tutorial_Boy","\n","^I am serious! And this situation is dire!","\n","^&SPEAK:Dan","\n","^Then why talk to us? Why not go to the police if it's that serious?","\n","^&SPEAK:Tutorial_Boy","\n","^Because they have ears everywhere! It's not safe!","\n","^&SPEAK:Arin","\n","^Dude who is \"they?\"","\n","^&SPEAK:Tutorial_Boy","\n","^I can't say yet, they could even be listening here!","\n","^&SPEAK:Dan","\n","^Dude, this is crazy","\n","^&SPEAK:Arin","\n","^So here's my number...","\n","^&SPEAK:Dan","\n","^Not now Arin!","\n","^So then how are you expecting us help you if you can't even tell us what's going on or who is involved?","\n","^&SPEAK:Tutorial_Boy","\n","^I have a train car we can speak openly in on our way to the city.","\n","^&SPEAK:Arin","\n","^Whoa dude, you have your own personal train car?","\n","^&SPEAK:Tutorial_Boy","\n","^Yes, and a Nice one at that. I can share the details with you there.","\n","^&SPEAK:Arin","\n","^This is crazy man. Like, do you really expect us to buy all this?","\n","^&SPEAK:Dan","\n","^Yeah, like how can you expect us to believe Attitude city is like a real place you can go?","\n","^&SPEAK:Tutorial_Boy","\n","^Where else do you think a person like me comes from?","\n","^&SPEAK:Arin","\n","^...","\n","^He's got a point, Dan.","\n","^&SPEAK:Dan","\n","^Well can you prove it? Surely you have something to back all this up.","\n","^&HIDE_TEXTBOX","\n","^&SET_POSE:Rummage","\n","^&WAIT: 1","\n","^Whoa WHOA there dude, I don't think we can legally show this.","\n","^&SPEAK:Arin","\n","^Yikes dude.","\n","^&SPEAK:Tutorial_Boy","\n","^Don't get your shirts in a twist... here, take a look at this!","\n","^&SET_POSE:Normal","\n","^&SPEAK:Dan","\n","^Wow... \"Attitude Serialized Sensations: A News publication.","\n","^This looks legit to me Arin.","\n","^&SET_POSE Angry","\n","^&SPEAK: Tutorial_Boy","\n","^Of course it's legit! What kind of city wouldn't have a","\n","^These days the news is pretty bad, just pointless distractions I don't have time for.","\n","^&ACTOR:Dan","\n","^&SET_POSE:Normal","\n","^&SPEAK:Dan","\n","^Hey Arin look at this! There are all these stories and photos!","\n","^&SPEAK:Arin","\n","^Yeah Dan, that's what a newspaper is.","\n","^&SPEAK:Dan","\n","^That's not what I mean, look dude! Apparently a new zoo just opened and...","\n","^&SET_POSE:Surprised","\n","^Holy SHIT, is that a small Dinosaur! WE TOTALLY HAVE TO GO MAN!","\n","^&ACTOR:Tutorial_Boy","\n","^&SET_POSE:Normal","\n","^&SPEAK:Tutorial_Boy","\n","^There, see? I knew you two would come around.","\n","^&SPEAK:Arin","\n","^Hold your horses there buddy, I'm not convinced. It's gonna take more than some Dinosaurs to get me invested.","\n","^&SPEAK:Dan","\n","^Are you KIDDING Arin? It's DINOSAURS, they're supposed to be extinct!","\n","^&SPEAK:Tutorial_Boy","\n","^Well, keep in mind you'll be going to help solve a serious...","\n","^&SPEAK:Arin","\n","^Look I know you have a thing for Dinosaurs, but doesn't this seem too convenient? What if they just made it up","\n","^&SPEAK:Dan","\n","^C'mon man, you owe me after all these years of stinking up the Grump room.","\n","^&SPEAK: Arin","\n","^HEY, those were GIFTS I gave you. Stinky, smelly gifts!","\n","^&SPEAK:Dan","\n","^That's the worst excuse I've ever heard... hey whoa wait check this out","\n","^&SPEAK:Arin","\n","^Huh?","\n","^&SPEAK:None","\n","^<color=green>\"The Attitude City SEGA branch is proud to announce It'll soon be releasing a Sonic game that is actually good! Details on this SEGA exclusive inside!\"","\n","^&SPEAK:Arin","\n","^...","\n","^&SPEAK:Dan","\n","^Arin?","\n","^&SPEAK:Arin","\n","^Alright Mr. Boy toy, I think we can trust you. We'll head to Attitude City and hear you out!","\n","^&SPEAK:Tutorial_Boy","\n","^Wait really?","\n","^&SPEAK:Dan","\n","^I guess you don't know much about Arin do you?","\n","^&SPEAK:Tutorial_Boy","\n","^I mean, no, but you do know there is crime afoot to--","\n","^&SPEAK:Arin","\n","^This HAS to be the first thing we do Dan, we can check out the Dinosaurs after.","\n","^What are the details? Can you--","\n","^&SET_POSE:Angry","\n","^&SPEAK:Tutorial_Boy","\n","^AHEM!","\n","^&SPEAK:Arin","\n","^Yes?","\n","^&SPEAK:Tutorial_Boy","\n","^I'll remind you that you'll be helping me with this situation, not necessarily running around checking out awesome things in our city.","\n","^This isn't a game, you know. This is serious!","\n","^&SPEAK:Arin","\n","^I guess, but I mean it's hard to take this seriously when you won't even tell us what's going on yet.","\n","^Not to mention this is all coming from someone wearing a trash bag and a tie.","\n","^&SPEAK:Tutorial_Boy","\n","^What are you talking about? This is just my body!","\n","^&SPEAK:Dan","\n","^Whoa, what?","\n","^&SPEAK:Arin","\n","^Wait, you're serious? Let me see...","\n","^&SPEAK:Tutorial_Boy","\n","^OWW, don't grab at me like that!","\n","^&SPEAK:Arin","\n","^That's so weird.","\n","^&SPEAK:Dan","\n","^Huh?","\n","^&SPEAK:Tutorial_Boy","\n","^That's very rude of you!","\n","^&SPEAK:Arin","\n","^It's like, disturbingly squishy. Are you really not wearing anything?","\n","^&SPEAK:Tutorial_Boy","\n","^For the last time yes!","\n","^&SPEAK:Dan","\n","^Wait... doesn't that mean that, like, you're naked right now?","\n","^&SPEAK:Tutorial_Boy","\n","^What...? What do you mean?","\n","^&SPEAK:Dan","\n","^...","\n","^&SPEAK:Arin","\n","^...","\n","^Well I guess you're wearing a tie, so technically...","\n","^&SPEAK:Dan","\n","^Arin...","\n","^&SPEAK:Arin","\n","^What? It's TECHNICALLY something he's wearing","\n","^&SPEAK:Tutorial_Boy","\n","^Can we just move on, please?","\n","^&SPEAK:Dan","\n","^Yeah, before this gets any weirder","\n","^&SPEAK:Arin","\n","^Fine.","\n","^...","\n","^So, like, do you have a skeleton or are you just a walking bag of organs?","\n","^&SPEAK:Dan","\n","^ARIN!","\n","^&SPEAK:Arin","\n","^DUDE how can you not be curious? I can't explain it, I just have to ask!","\n","^&SET_POSE:Sweaty","\n","^&SPEAK: Tutorial_Boy","\n","^I'm starting to think I've made a terrible mistake...","\n","^&SPEAK:Dan","\n","^Well at least you aren't slamming your head around. What was up with that?","\n","^&SET_POSE:Normal","\n","^&SPEAK: Tutorial_Boy","\n","^Oh yes, that, well I guess you could say I'm very passionate about my work.","\n","^&THINK:Arin","\n","^(That's one way of putting it...)","\n","^&SPEAK:Dan","\n","^So you actually ARE an attorney then?","\n","^&SPEAK:Tutorial_Boy","\n","^Yes of course! I work for the Attitude City Courthouse downtown.","\n","^I hope it's enough to trust me on this, we need to prepare to leave at once!","\n","^We'll be taking the Steam Train to Attitude City. It will take about a day, and you might be there for a while so pack accordingly.","\n","^I already have your tickets purchased, and it's part of the Fast Action Rail Transit System, a top of the line railway that connects the city to the rest of the country","\n","^&SPEAK:Dan","\n","^Wow, nice of you to pay our way there.","\n","^&SET_POSE:Normal","\n","^&SPEAK: Tutorial_Boy","\n","^Think nothing of it my good man. The Boy family prides itself on our class and generosity.","\n","^&SPEAK:Ross","\n","^Well if that's the case, can I tag along?","\n","^&SPEAK:Dan","\n","^Oh hey Ross, I thought you were busy on that level you're making for us.","\n","^&ACTOR:Ross","\n","^&SET_POSE:Normal","\n","^&SPEAK:Ross","\n","^I was, but I couldn't help but be curious about what was going. I didn't hear all the details but it sounds exciting and I want in!","\n","^&SPEAK:Tutorial_Boy","\n","^I appreciate the sentiment, but this is serious business. I don't think it's a good idea","\n","^&SPEAK:Ross","\n","^Well I mean you DO kind of owe me for putting me and my reputation at stake for that little skit we did.","\n","^&SPEAK:Dan","\n","^Wait I thought it was for the 10 Minute Power Hour","\n","^&SPEAK:Ross","\n","^Well it is, but it wasn't originally. I guess he wanted to test your skills or something?","\n","^It was my idea to record it. Thought it would make for a good episode.","\n","^&SPEAK:Dan","\n","^Well you're probably right. What do you think Arin?","\n","^&SPEAK:Arin","\n","^Uh, well yeah I guess so. I don't see any reason why not.","\n","^&ACTOR:Tutorial_Boy","\n","^&SET_POSE:Angry","\n","^&SPEAK:Tutorial_Boy","\n","^AHEM!","\n","^I see a reason! There is a criminal conspiracy to deal with, there is no room to \"tag along\" my friend!","\n","^&SPEAK:Dan","\n","^Well he DID help you out, I think you owe him one.","\n","^&SPEAK:Arin","\n","^C'mon, Ross is a good guy, I'm sure he can help us out here.","\n","^&SPEAK:Ross","\n","^Yeah, some have said I'm the goodest guy.","\n","^&SPEAK:Dan","\n","^Ross, not only has nobody said that to you, nobody would <i>ever</i> say that to anyone.","\n","^I mean, goodest?","\n","^Really?","\n","^&SPEAK:Arin","\n","^In spite of what you may think, he's a pretty smart guy.","\n","^I bet you he can help us all out.","\n","^&SPEAK: Tutorial_Boy","\n","^Ugh... Alright, I guess. You can come too.","\n","^&SPEAK:Ross","\n","^Awesome!","\n","^&SPEAK:Arin","\n","^... and shid and fart too, while you're at it.","\n","^&SPEAK:Ross","\n","^C'mon dude, really?","\n","^&ACTOR:Dan","\n","^&SET_POSE:Laugh","\n","^&SPEAK:Dan","\n","^Hahahaha","\n","^&ACTOR:Tutorial_Boy","\n","^&SET_POSE:Angry","\n","^&SPEAK:Tutorial_Boy","\n","^ANYWAYs.","\n","^&SET_POSE:Normal","\n","^Please ready yourselves. The train is leaving first thing in the morning.","\n","^I will meet you all at the station. Until then, rest up and I'll see in the morrow.","\n","^&ACTOR:Dan","\n","^&SET_POSE:Happy","\n","^&SPEAK:Dan","\n","^I'm going to get ready to take video of real-ass dinosaurs. D'you think they have any stegosauruses there?","\n","^&SPEAK:Arin","\n","^Yeah why wouldn't they! But we gotta see that new Sonic game first.","\n","^&SPEAK:Dan","\n","^Hell yeah, this is gonna be awesome! I can't wait!","\n","^&SPEAK:Tutorial_Boy","\n","^Well remember, we're going for busin--","\n","^&SET_POSE:Surprise","\n","^&SPEAK: Dan","\n","^You think it's a mobile game? Maybe we can do both AT THE SAME TIME!","\n","^&SET_POSE:Happy","\n","^&SPEAK:Dan","\n","^That would kick ass!","\n","^&SPEAK:Arin","\n","^Dude we should go look it up RIGHT NOW!","\n","^&ACTOR:Tutorial_Boy","\n","^&SPEAK:Tutorial_Boy","\n","^Ugh... what did I get myself into...","\n","^&FADE_OUT:2","\n","^&SCENE:TrainStation","\n","^FADE_IN 2","\n","end",["done",{"#f":5,"#n":"g-0"}],null],"done",{"#f":1}],"listDefs":{}}